Parameter Study/casebase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    out
    {
        type            patch;
        nFaces          80;
        startFace       18180;
    }
    sym1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       18260;
    }
    sym2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       18360;
    }
    in
    {
        type            patch;
        nFaces          80;
        startFace       18460;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       18540;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9200;
        startFace       18620;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9200;
        startFace       27820;
    }
)

// ************************************************************************* //
